{
    "name": "Ensure multi-factor authentication (MFA) is enabled for all IAM users with administrator rights that have a console password",
    "description": "Multi-Factor Authentication (MFA) adds an extra layer of protection on top of a username and password. With MFA enabled, when a user signs in to an AWS website, they will be prompted for their username and password as well as for an authentication code from their AWS MFA device. It is recommended to enable MFA for all accounts that have a console password. Enabling MFA provides increased security for console access as it requires the authenticating principal to possess a device that emits a time-sensitive key and have knowledge of a credential.",
    "severity": "Critical",
    "logic": "IamUser where passwordEnabled='true' and combinedPolicies contain [ policyDocument.Statement contain[  (Effect='Allow') and  (Action='*' and Resource='*') ]] should not have mfaActive=false",
    "remediation": "From Portal\nPerform the following steps to enable MFA:\n1. Sign in to the AWS Management Console and open the IAM console at https://console.aws.amazon.com/iam/\n2. In the navigation pane, choose Users.\n3. In the User Name list, choose the name of the intended MFA user.\n4. Choose the Security Credentials tab, and then choose Manage MFA Device.\n5. In the Manage MFA Device wizard, choose A virtual MFA device, and then choose Next Step.\nNote: IAM generates and displays configuration information for the virtual MFA device, including a QR code graphic. The graphic is a representation of the 'secret configuration key' that is available for manual entry on devices that do not support QR codes.\n6. Open your virtual MFA application. (For a list of apps that you can use for hosting virtual MFA devices, see Virtual MFA Applications.) If the virtual MFA application supports multiple accounts (multiple virtual MFA devices), choose the option to create a new account (a new virtual MFA device).\n7. Determine whether the MFA app supports QR codes, and then do one of the following:\n7.1 Use the app to scan the QR code. For example, you might choose the camera icon or choose an option similar to Scan code, and then use the device's camera to scan the code.\n7.2 In the Manage MFA Device wizard, choose Show secret key for manual configuration, and then type the secret configuration key into your MFA application. When you are finished, the virtual MFA device starts generating one-time passwords.\n8. In the Manage MFA Device wizard, in the Authentication Code 1 box, type the one-time password that currently appears in the virtual MFA device. Wait up to 30 seconds for the device to generate a new one-time password. Then type the second one-time password into the Authentication Code 2 box. Choose Active Virtual MFA.\n\nFrom Command Line\n1. First of all we need to create the virtual MFA device.\n\naws iam create-virtual-mfa-device --virtual-mfa-device-name MFA_DEVICE_NAME --outfile FILENAME.PNG --bootstrap-method QRCodePNG\n\n2. Sync your mobile device with the desired MFA authenticator.\nNote: You need to open Authenticator app and scan the QRCode generated from above step.\n\n3. Generate two authentication codes with the MFA authenticator, Note down the codes and use those in below command.\n\n4. Next step is to enable the virtual MFA device for user using the two MFA codes generated in previous step.\n\naws iam enable-mfa-device --user-name USER_NAME --serial-number MFA_DEVICE_ARN --authentication-code1 ENTER CODE1 --authentication-code2 ENTER CODE2\n\n\nReferences\n1. https://workbench.cisecurity.org/sections/43739/recommendations/115378\n2. https://docs.aws.amazon.com/IAM/latest/UserGuide/id_credentials_mfa.html\n3. https://docs.aws.amazon.com/IAM/latest/UserGuide/best-practices.html#enable-mfa-for-privileged-users\n4. https://docs.aws.amazon.com/IAM/latest/UserGuide/id_credentials_mfa_enable_virtual.html",
    "complianceTag": "",
    "logicHash": "3WXX7NWZSJ+NoBy/iZ6Wyg",
    "ruleId": "",
    "category": ""
}